<?php

echo '<pre>';

//==============================================================================

echo '=================================================================='."\n";
echo "\n\n Task 1: \n\n";
echo '=================================================================='."\n";

//1. Създайте едномерен масив, 
//съдържащ аритметична прогресия
// с разлика от 4, започваща от 0

const  MAX_SIZE = 20;
echo '------------------------------------------'."\n";
//----------------------------------------
echo "Arithmetic progression: 1"."\n";

for($i = 0; $i <= MAX_SIZE; $i += 4)
{
    $arrayArithmeticProgression1[] = $i;
}

print_r($arrayArithmeticProgression1)."\n";

//----------------------------------------------------------
echo '------------------------------------------'."\n";
//!!! key -> 0 4 8 .... 
echo "Arithmetic progression: 2"."\n";
for($i = 0; $i <= MAX_SIZE; $i+= 4)
{
    $arrayArithmeticProgression2[$i] = $i; 
   
}

/*
for($i = 0; $i <= MAX_SIZE; $i+= 4)
{
    echo $arrayArithmeticProgression2[$i]."  "; 
   
}
 
echo "\n";
 */
print_r($arrayArithmeticProgression2)."\n";

 

// ---------------------------------------------------
echo '------------------------------------------'."\n";
echo "Arithmetic progression: 3"."\n";
for($i = 0; $i <= MAX_SIZE; $i += 4)
{
    $arrayArithmeticProgression3[] = $i; 
   
}

print_r($arrayArithmeticProgression3)."\n";


//-----------------------------------------------
echo '------------------------------------------'."\n";
echo "Arithmetic progression: 4"."\n";
$i = 0;
while ($i <= MAX_SIZE)
{
    $arrayArithmeticProgression4[] = $i;
    $i+=4;
}

print_r($arrayArithmeticProgression4)."\n";


//==============================================================================
echo '=================================================================='."\n";
echo "\n\n Task 2: \n\n";
echo '=================================================================='."\n";

//2. Създайте многомерем масив,
// изобразяващ шахматна дъска 
// и поставете кона на f6

$chessBoard8x8 = array(     
    8 => array('a' => '0', 'b' => '0', 'c' => '0', 'd' => '0', 'e' => '0', 'f' => '0', 'g' => '0', 'h' => '0'),  
    7 => array('a' => '0', 'b' => '0', 'c' => '0', 'd' => '0', 'e' => '0', 'f' => '0', 'g' => '0', 'h' => '0'),  
    6 => array('a' => '0', 'b' => '0', 'c' => '0', 'd' => '0', 'e' => '0', 'f' => '0', 'g' => '0', 'h' => '0'),   
    5 => array('a' => '0', 'b' => '0', 'c' => '0', 'd' => '0', 'e' => '0', 'f' => '0', 'g' => '0', 'h' => '0'), 
    4 => array('a' => '0', 'b' => '0', 'c' => '0', 'd' => '0', 'e' => '0', 'f' => '0', 'g' => '0', 'h' => '0'),  
    3 => array('a' => '0', 'b' => '0', 'c' => '0', 'd' => '0', 'e' => '0', 'f' => '0', 'g' => '0', 'h' => '0'),  
    2 => array('a' => '0', 'b' => '0', 'c' => '0', 'd' => '0', 'e' => '0', 'f' => '0', 'g' => '0', 'h' => '0'),   
    1 => array('a' => '0', 'b' => '0', 'c' => '0', 'd' => '0', 'e' => '0', 'f' => '0', 'g' => '0', 'h' => '0'),   
); 

echo "ChessBoard8x8 ( "."\n";

for($i = 8; $i >= 1; $i--)
{
    echo $i. " => ";
    print_r($chessBoard8x8[$i])."\n";
}
 
 echo ") \n";
 
 echo "\n\n\nInsert in chessBoard8x8 - f6  -> Knight \n\n\n\n";
 
$chessBoard8x8[6]['f'] = 'Knight';


echo "ChessBoard8x8 ( "."\n";

for($i = 8; $i >= 1; $i--)
{
    echo $i. " => ";
    print_r($chessBoard8x8[$i])."\n";
}
 
 echo ") \n";
 
 //=============================================================================
 
echo '=================================================================='."\n";
echo "\n\n Task 3: \n\n";
echo '=================================================================='."\n";
 
 
//3. Създайте и запълнете многомерен масив, репрезентиращ следните данни
 
//-Създайте програма, запълваща новосъздадената структира със произволни данни, 
//така че всеки потребител да има между 2 и 8 поръчки и да има най-малко 
//100 потребителя

//-Създайте програма, която да изведе ID на потребителя, 
//генерирал най много оборот

//-Създайте програма, която да изведе ID на потребителя,
// направил най много поръчки

//-Създайте програма, която да създава нов масив, в който записите да са 
//сортирани по общ оборот

//-Създайте програма, която да създава нов масив, в който записите да са 
//сортирани по брой поръчки 

$users = [ ['id' => 1,
            'username' => "john", 
            'password' => "pass4312", 
            'orders' => ["0001, 234 \$", "0005, 45 \$", "0008, 17 \$"]],
           ['id' => 2, 
            'username' => "amanda",
            'password' => "pass555", 
            'orders' => ["0002, 37 \$", "0006, 125 \$"]]];

/*
for($i = 0; $i <= 1; $i++)
    print_r($users[$i])."\n";
 */   
    
print_r($users)."\n"; 


echo "---------------------------------------------"."\n";
 
 
 ?>

